#include "head.h"

//Функция выводит всю первичную информацию для работы с программой
void print_rules(void)
{
    puts("==ПЕРЕМНОЖЕНИЕ ВЕЩЕСТВЕННОГО И ЦЕЛОГО ЧИСЕЛ, ВЫХОДЯЩИХ ЗА ПРЕДЕЛЫ РАЗРЯДНОЙ СЕТКИ==");
    puts(g"Правила ввода вещественного числа:"w);
    puts("1) Мантисса может представляться с точкой и без нее: 12.34 или 1234 или 1234. или .1234");
    puts("2) Мантисса может содержать не более 30 цифр");
    puts("3) Порядок при вводе может быть или не быть: 1234 или 1234E0 или 12.34E2");
    puts("4) Порядок может содержать не более 5 цифр");
    puts("5) Регистр знака, отделяющего порядок от мантиссы, не важен: E или e");
    puts("6) Возможно отсутствие знака порядка и/или мантиссы, по умолчанию '+' ");
    puts(g"Правила ввода целого числа:"w);
    puts("7) Возможно отсутствие знака числа, по умолчанию '+' ");
    puts("8) Число может содержать не более 30 цифр");
    printf("\n");
    puts("                             +|........|.........|.........|E+|...|");
}
