# Программа определяет принадлежность точки к графику функции
# Автор - Светличная Алина, ИУ7 - 13Б

z = False
x,y = map(float,input('Введите координаты точки: ').split())

#Попадание в левое вехнеее крыло
if   ((-9 <=x<= -1) and (y<= (-1)/8 * (x + 9)**2 + 8)) and \
(((-9 <=x<= -8) and ( y>= 7 * (x + 8)**2 +1)) or \
((-8 <=x<= -1) and (y>= 1/49 * (x + 1)**2))):
    z = True
  
#Попадание в правое вехнеее крыло
if   ((1 <=x<= 9) and (y<= (-1)/8 * (x - 9)**2 + 8)) and \
(((8 <=x<= 9) and ( y>= 7 * (x - 8)**2 +1)) or \
((1 <=x<= 8) and (y>= 1/49 * (x - 1)**2))):
    z = True

#Попадание в левое нижнее крыло
if   ((-8 <=x<= -1) and (y<= (-4)/49 * (x + 1)**2)) and \
(((-8 <=x<= -2) and ( y>= 1/3 * (x + 5)**2 -7)) or \
((-2 <=x<= -1) and (y>= 2 * (x + 1)**2))):
    z = True

#Попадание в правое нижнее крыло
if   ((1 <=x<= 8) and (y<= (-4)/49 * (x - 1)**2)) and \
(((2 <=x<= 8) and ( y>= 1/3 * (x - 5)**2 -7)) or \
((1 <=x<= 2) and (y>= 2 * (x - 1)**2))):
    z = True

#Попадание в тело
if ((-1 <=x<= 1) and (y<= (-4) * x**2 + 2) and (y>= 4 * x**2 - 6)):
    z = True

#Попадание на усики
if ((0 <=x<= 2) and (y == 1.5 * x + 2)) or ((-2 <=x<= 0) and \
(y == (-1.5) * x + 2)):
    z = True

if z:
    print('Точка принадлежит заданному графику')
else:
    print('Точка не принадлежит заданному графику')
