# Программа высчитывает объем, площадь поверхности, радиус вписанной и описанной
# окружности по заданному ребру
# Автор - Светличная Алина, ИУ7 - 13Б
a = float(input('Введите числовое значение стороны додекаэдра: '))# Блок ввода
while a <= 0: # Блок проверки существования заданного додекаэдра
    print('Ребро додекаэдра должно иметь положительное числовое значение')
    a = float(input('Введите числовое значение стороны додекаэдра: '))
    
from math import sqrt
v = ((a**3) * (15 + 7*sqrt(5)))/ 4 # Значение объема
s = 3 * a**2 * sqrt(5 * (5 + 2*sqrt(5)))  # Значение площади поверхности
r1 = (a * sqrt(10*(25 + 11*sqrt(5))))/20 # Значение радиуса вписанной окружности
r2 = (a* sqrt(3) *(1+sqrt(5)))/4 # Значение радиуса описанной окружности


# Блок вывода
print('Объем: {:.7g}'.format(v)) 
print('Площадь поверхности: {:.7g}'.format(s))
print('Радиус вписанной окружности:','{:.7g}'.format(r1))
print('Радиус описанной окружности:','{:.7g}'.format(r2))
