#Программа формирует вектор отрицательных элемнтов заданной матрицы и сортирует
#их по возрастанию
#Автор - Светличная Алина, ИУ7 - 13Б

n1 = input('Введите количество строк матрицы \
(максимальное занчение - 8): ')

#Проверказначения количества строк на принадлежность натуральным числам
#и заданному промежутку
isok = True
while isok:
    
    while not(n1.isnumeric()):
            print('Введено не натуральное число')
            n1 = input('Введите количество строк матрицы: ')
        
    n1 = int(n1)

    if n1 > 8 or n1 == 0:
        print('Введено число, не принадлежащее заданному промежутку')
        isok = True
        n1 = input('Введите количество строк матрицы \
(максимальное занчение - 8): ')
    else:
        isok = False

n2 = (input('Введите количество столбцов матрицы \
(максимальное занчение - 10) : '))

#Проверказначения количества столбцов на принадлежность натуральным числам
#и заданному промежутку
isok = True
while isok:
    
    while not(n2.isnumeric()):
            print('Введено не натуральное число')
            n2 = (input('Введите количество столбцов матрицы \
(максимальное занчение - 10) : '))
        
    n2 = int(n2)

    if n2 > 8 or n1 == 0:
        print('Введено число, не принадлежащее заданному промежутку')
        isok = True
        n2 = (input('Введите количество столбцов матрицы \
(максимальное занчение - 10) : '))
    else:
        isok = False


#Задание нулевой матрицы
A = list()
for i in range(n1):
    n = [0] *  n2
    A.append(n)

#Считывание матрицы    
print('Введите все элементы матрицы(построчно): ')
for i in range(n1):
    A1 = input().split()
    for j in range(n2):
        A[i][j] = float(A1[j])

print('Исходная матрица: ')
for i in range(n1):
    for j in range(n2):
        print('{:7.4g}'.format(A[i][j]), end = ' ')
    print()

#Формирование массива отрицательных элемнтов заданной матрицы
P = []       
for i in range(n1):
    for j in range(n2):
        if A[i][j] < 0:
            P.append(A[i][j])

#Сортировка массива по возрастанию методом "пузырька"
isok = True
while isok:
    isok = False
    for i in range(len(P) - 1):
        if P[i] > P[i + 1]:
            P[i], P[i + 1] = P[i + 1], P[i]
            isok = True

if P == []:
    print('В исходной матрице нет отрицательных элементов, а следовательно, \
список P пуст')
else:
    print('Получившийся массив: ')
    for i in range(len(P)):
        print('{:7.4g}'.format(P[i]), end = ' ')
