#Программа формирует вектор ненулевых элемнтов (ход по столбцам) заданной
#матрицы и заменяет третий отрицательный его элемента на сумму предшествующих
#Автор - Светличная Алина, ИУ7 - 13Б
maxn1 = 8
maxn2 = 9

n1 = input('Введите количество строк матрицы \
(максимальное занчение - 8): ')

#Проверказначения количества строк на принадлежность натуральным числам
#и заданному промежутку
isok = True
while isok:
    
    while not(n1.isnumeric()):
            print('Введено не натуральное число')
            n1 = input('Введите количество строк матрицы: ')
        
    n1 = int(n1)

    if n1 > maxn1 or n1 == 0:
        print('Введено число, не принадлежащее заданному промежутку')
        isok = True
        n1 = input('Введите количество строк матрицы \
(максимальное занчение - 8): ')
    else:
        isok = False


n2 = (input('Введите количество столбцов матрицы \
(максимальное занчение - 9) : '))

#Проверказначения количества столбцов на принадлежность натуральным числам
#и заданному промежутку
isok = True
while isok:
    
    while not(n2.isnumeric()):
            print('Введено не натуральное число')
            n2 = (input('Введите количество столбцов матрицы \
(максимальное занчение - 9) : '))
        
    n2 = int(n2)

    if n2 > maxn2 or n2 == 0:
        print('Введено число, не принадлежащее заданному промежутку')
        isok = True
        n2 = (input('Введите количество столбцов матрицы \
(максимальное занчение - 9) : '))
    else:
        isok = False


#Задание нулевой матрицы
Z = list()
for i in range(maxn1):
    n = [0]*maxn2
    Z.append(n)

#Считывание матрицы    
print('Введите все элементы матрицы(построчно): ')
for i in range(n1):
    Z1 = input().split()
    for j in range(n2):
        Z[i][j] = int(Z1[j])

print('Исходная матрица: ')
for i in range(n1):
    for j in range(n2):
        print('{:7.4g}'.format(Z[i][j]), end = ' ')
    print()

#Формирование массива ненулевых элемнтов заданной матрицы
R = []       
for j in range(n2):
    for i in range(n1):
        if Z[i][j] != 0:
            R.append(Z[i][j])

#Поиск в массиве третьего отрицательного элемента и замена его на сумму
#предшествующих
k = 0
sum1 = 0
for i in range(len(R)):

    if R[i] < 0 and k < 3:
        k += 1

    if k < 3:
        sum1 += R[i]

    if k == 3:
        R[i] = sum1
        break

if k < 3:
    print('В полученном векторе менее 3 отрицательных элементов')

print('Получившийся вектор: ')
for i in range(len(R)):
    print('{:7.4g}'.format(R[i]), end = ' ')
