#Программа вычисляет сумму бесконечного ряда с заданной точностью
#за заданное количество итераций
#Автор - Светличная Алина, группа ИУ7 - 13Б

from math import factorial

x = float(input('Введите значение переменной x: '))

#Проверка корректности данных
while x >=1  or x <= -1:
    print ('Введено такое значение переменной x, при котором \
ряд не является сходящимся')
    x = float(input('Введите значение переменной x: '))


E = float(input('Введите точность вычисления суммы ряда: '))
sh = float(input('Введите шаг печати  итераций: '))

#Проверка корректности данных
while sh <= 0:
    print ('Введен неположительный шаг печати итераций')
    sh = float(input('Введите шаг печати  итераций: '))

m = float(input('Введите максимальное значение итераций: '))

### Блок вывода шапки таблицы значений функции
for i in range(46):
    print('-', end = '')

print()
print('|', end = '')
print('{:^13}'.format('№'), sep = '', end = '')
print(' |', end = '')
print('{:^13}'.format('X'), sep = '', end = '')
print(' |', end = '')
print('{:^13}'.format('Y'), sep = '', end = '')
print(' |', end = '')    

print()
for i in range(46):
    print('-', end = '')
###


n = 0 
x1 = 1
y = 0

while n + 1 <= m and abs(x1) >= E:

    x1 = (-1)**n + (n + 1) * x ** n #Вычисление каждого нового члена
                                   #бесконечного ряда
    y += x1 #Вычисление суммы бесконечного ряда для каждого нового члена ряда

    if n % sh == 0:
        print()
        print('|', end = '')
        print('{:^13}'.format(n + 1), sep = '', end = '')
        print(' |', end = '')
        print('{:^13.5g}'.format(x1), sep = '', end = '')
        print(' |', end = '')
        print('{:^13.5g}'.format(y), sep = '', end = '')
        print(' |', end = '')    

    n += 1 

print()
for i in range(46):
    print('-', end = '')


#Проверка существования члена бесконекчного ряда заданной точности
#на заданном количестве итераций
print()
if n + 1 > m: #Номер последней итерации на 1 больше
              #номера последнего вхождения в цикл
    print('За заданное количество итераций не была вычислена сумма бесконечного \
ряда с имеющейся точностью')
else:
    print('Искомое значение суммы бесконечного ряда с заданной точностью: \
{:.5g} '.format(y))
