#Автор - Светличная Алина, группа ИУ7 - 13Б 
x = input('Введите число x: ')
d = len(x)

m = p = t = 0
isok = isok1 = isok2 = True

for i in range(d):
    if x[i] == 'e':
        form = 'exp'
        k = i
        break
    else: form = 'float, int'

if form == 'exp':

    for i in range(k):

        if (x[0] == '-' and m == 0) or (x[0] == '+' and p == 0) or '0' <= x[i] <= '9' or (x[i] == '.' and t == 0): 

            if x[i] == '.':
                t += 1

            if x[i] == '-':
                m += 1

            if x[i] == '+':
                p += 1

            isok1 = False

        else: isok1 = True


        #Проверка каждого элемента строки на выполнение условий для вещественного числа
        #прекращение дальнейшего рассмотрения элементов в случае невыполнения условий 
        if isok1:
            break


    for i in range(k+1, d):

        if (x[k+1] == '-' and m == 0) or (x[k+1] == '+' and p == 0) or '0' <= x[i] <= '9': 

            if x[i] == '-':
                    m += 1

            if x[i] == '+':
                p += 1


            isok2 = False

        else: isok2 = True


        #Проверка каждого элемента строки на выполнение условий для вещественного числа
        #прекращение дальнейшего рассмотрения элементов в случае невыполнения условий 
        if isok2:
            break


    #Проверка вариантов выхода из цикла - прекращением в случае невыполнения условий,
    #полным проходом в случае выполнения всех условий
    if isok1 or isok2:
        print('Строка не является вещественным числом')
    else: print('Строка является вещественным числом')


    


#Случай представления числа в виде целого либо вещественного с точкой
if form == 'float, int':

    for i in range(d):
        
        if (x[0] == '-' and m == 0) or (x[0] == '+' and p == 0) or '0' <= x[i] <= '9' or (x[i] == '.' and t == 0): 
            if x[i] == '.':
                t += 1

            if x[i] == '-':
                m += 1

            if x[i] == '+':
                p += 1

            isok = False

        else: isok = True


        #Проверка каждого элемента строки на выполнение условий для вещественного числа
        #прекращение дальнейшего рассмотрения элементов в случае невыполнения условий 
        if isok:
            break



    #Проверка вариантов выхода из цикла - прекращением в случае невыполнения условий,
    #полным проходом в случае выполнения всех условий
    if isok:
        print('Строка не является вещественным числом')
    else: print('Строка является вещественным числом')
