# Программа высчитывает некоторые величины треугольника по заданным
# координатам вершин
# Автор - Светличная Алина, ИУ7 - 13Б


#Задание 1

xA, yA = map(int, input('Введите координаты вершины A треугольника: ')\
. split())
xB, yB = map(int, input('Введите координаты вершины B треугольника: ')\
. split())
xC, yC = map(int, input('Введите координаты вершины C треугольника: ')\
. split())

c =((xA - xB)**2 + (yA - yB)**2)**(1/2)#Поиск длины стороны AB
b =((xA - xC)**2 + (yA - yC)**2)**(1/2)#Поиск длины стороны AC
a =((xC - xB)**2 + (yC - yB)**2)**(1/2)#Поиск длины стороны BC

#Проверка корректности данных
if a+b <= c or a+c <= b or b+c <=a:
    no = True
else: no = False

while no:
    print('Введены некорректные данные, точки не выстраивают треугольник')
    xA, yA = map(int, input('Введите координаты вершины A треугольника: ')\
. split())
    xB, yB = map(int, input('Введите координаты вершины B треугольника: ')\
. split())
    xC, yC = map(int, input('Введите координаты вершины C треугольника: ')\
. split())
    
    c =((xA - xB)**2 + (yA - yB)**2)**(1/2)#Поиск длины стороны AB
    b =((xA - xC)**2 + (yA - yC)**2)**(1/2)#Поиск длины стороны AC
    a =((xC - xB)**2 + (yC - yB)**2)**(1/2)#Поиск длины стороны BC
    
    if (a+b <= c) or (a+c <= b) or (b+c <=a):
        no = True
    else: no = False

print('Сторона BC = {:.7g}'.format(a))
print('Сторона AC = {:.7g}'.format(b))
print('Сторона AB = {:.7g}'.format(c))


#Задание 3


#Вычисление косинусов углов треугольника
cosA = ((xB - xA) *(xC- xA) + (yB - yA) *(yC- yA))/(b *c)
cosB = ((xC - xB) *(xA- xB) + (yC - yB) *(yA- yB))/(a *c)
cosC = ((xB - xC) *(xA- xC) + (yB - yC) *(yA- yC))/(a *b)

#Проверка вида угла через косинус, блок вывода
if 0 < cosA < 1 and 0 < cosB < 1 and 0 < cosC < 1:
    print('Треугольник остроугольный')
else:
    print('Треугольник не остроугольный')



#Задание 2
    

#Определение наибольшего угла треугольника и соответствующей противолежащей
#стороны, а также согласно формуле определение произведения и суммы двух других
#сторон
if cosA < cosB < cosC:
    m = a
    p = b * c
    s = b + c
else:
    if cosB < cosA < cosC:
        m = b
        p = a * c
        s = a + c
    else:
        m = c
        p = a * b
        s = a + b

#Определение длины биссектрисы, блок вывода
l=((p * (s + m) * (s - m))**(1/2)) / s
print('Биссектриса = {:.7g}'.format(l))



#Задание 4

x0, y0 = map(float, input('Введите x, y координату точки соответственно: ')\
.split())

#Проверка принадлежности точки треугольнику
s1 = (xA - x0) * (yB - yA) - (xB - xA) * (yA-y0)
s2 = (xB - x0) * (yC - yB) - (xC - xB) * (yB-y0)
s3 = (xC - x0) * (yA - yC) - (xA - xC) * (yC-y0)

if (s1<0 and s2<0 and s3<0) or (s1>0 and s2>0 and s3>0) or\
(s1 == 0  or s2 == 0 or s3 == 0):
    isOK=1
else: isOK=0

if isOK == 1:
    print('Точка принадлежит треугольнику')
    
    from math import sqrt
    OB = sqrt((x0-xB)**2 + (y0-yB)**2)
    OA = sqrt((x0-xA)**2 + (y0-yA)**2)
    OC = sqrt((x0-xC)**2 + (y0-yC)**2)
    
    #Поиск расстояния от точки до стороны AB
    rc = 2 * sqrt((OA+OB+c)/ 2 * ((OA+OB+c)/ 2 - OA)* ((OA+OB+c)/ 2 - OB) * \
    ((OA+OB+c)/ 2 - c)) / c

    #Поиск расстояния от точки до стороны AC
    rb = 2 * sqrt((OA+OC+b)/ 2 * ((OA+OC+b)/ 2 - OA)* ((OA+OC+b)/ 2 - OC) * \
    ((OA+OC+b)/ 2 - b)) / b

    #Поиск расстояния от точки до стороны BC
    ra = 2 * sqrt((OB+OC+a)/ 2 * ((OB+OC+a)/ 2 - OB)* ((OB+OC+a)/ 2 - OC) * \
    ((OB+OC+a)/ 2 - a)) / a

    r = max(ra, rb, rc)

    print('Расстояние от наиболее удаленной стороны = {:.7g}'.format(r))

else: print('Точка не принадлежит треугольнику')








