# Программа высчитывает корни квадратного уравнения по заданным числовым
#коэффициентам
# Автор - Светличная Алина, ИУ7 - 13Б

# Блок ввода
a, b, c = map(float, input('Введите числовые коэффициенты согасно уменьшению \
степеней квадратного уравнения: ').split()) 

if a == 0:
    if b == 0:
        if c == 0:
            print('X - любое число') # Не является квадратным уравнением, 
                                     # всегда сохраняется равенство нулей
                                     # Блок вывода 
            
        else:
            print('Нет решений') # График прямой параллельной оси OX, блок вывода
            
    else:
        x = -c/b
        print('X =  {:.7g}'.format(x)) # Линейное уравнение, блок вывода
        
else:
    D = b**2 - 4*a*c
    if D < 0:
        print('Нет решений') # График функции не пересекает ось OX, блок вывода
        
    else:
        if D == 0:
            x = -b/(2*a)
            print('X =  {:.7g}'.format(x)) # Вершина параболы лежит на оси OX
                                           # Блок вывода
            
            # График функции пересекает ось OX в двух точках, блок вывода
        else:
            x1= (-b + D**(1/2))/(2*a)
            x2= (-b - D**(1/2))/(2*a)
            print('X1 =  {:.7g}'.format(x1))
            print('X2 =  {:.7g}'.format(x2))
     
