    X = [12.80,10.91,10.69,10.46,13.08,11.35,13.07,12.46,13.29,11.09,...
        10.34,12.57,12.99,12.28,12.62,12.43,12.06,13.72,11.64,11.81,...
        10.47,13.94,13.31,13.31,11.11,11.06,11.84,12.28,13.14,9.80,...
        11.27,12.56,11.15,11.65,11.92,11.31,12.07,12.06,11.53,12.04,...
        12.44,13.89,10.72,11.75,11.14,12.70,13.64,12.64,11.37,10.12,...
        11.87,13.86,12.53,12.52,10.65,9.84,11.15,9.54,11.39,11.57,...
        14.00,10.98,10.81,12.11,12.24,10.42,15.21,13.00,11.63,11.40,...
        13.41,10.78,11.98,12.51,12.95,11.59,11.04,10.99,11.91,10.72,...
        11.74,11.82,12.45,11.70,12.49,12.10,10.99,12.58,12.99,10.09,...
        12.00,13.19,12.89,11.72,13.80,11.37,12.15,10.98,11.93,10.83,...
        12.41,12.52,12.21,12.82,12.38,11.59,13.60,12.82,13.52,13.73,...
        12.53,10.78,13.69,10.41,11.13,11.28,11.28,10.40,10.47,10.51];

    X = sort(X);
    n = length(X);

% Максимальное и минимальное значение
    M_max = X(n);
    M_min = X(1);
    fprintf("\nМаксимальное значение = %.4f\n", M_max);
    fprintf("Минимальное значение = %.4f\n", M_min);

% Размах выборки
    R = M_max - M_min;
    fprintf("\nРазмах выборки = %.4f\n", R);

% Оценка математического ожидания и дисперсии
    mu = sum(X) / n;
    S2 = sum((X-mu).^2) / (n - 1);
    fprintf("\nОценка математического ожидания = %.4f\n", mu);
    fprintf("Оценка дисперсии = %.4f\n", S2);

% Группировка значений выборки в интервалы
    m = floor(log2(n)) + 2;
    fprintf("\nЧисло интервалов = %d\n\n", m);

    d = (X(n) - X(1)) / m;

    J = [];

    for i = 1 : m
      J(i, 1) = X(1) + (i - 1) * d;
      J(i, 2) = X(1) + i * d;
    end
 
    N = zeros(m);
    
    for i = 1 : n
      for j = 1 : m
        if X(i) >= J(j, 1) && X(i) < J(j, 2)
          N(j) = N(j) + 1;
        end
      end
    end
    
    N(m) = N(m) + 1;
    
    for i = 1 : m - 1
      fprintf("[%.4f,%.4f) - %d\n", J(i, 1), J(i, 2), N(i));
    end
    
    fprintf("[%.4f,%.4f] - %d\n", J(m, 1), J(m, 2), N(m));

%Построение графиков
    f = [];
    
    for i = 1 : m
      f(i, 1) = (J(i, 1) + J(i, 2)) / 2;
      f(i, 2) = N(i) / (n * d);
    end
    
    args = 8:1e-4:17;
    sigma = sqrt(S2);
    f_normal = normpdf(args, mu, sigma);

    bar(f(:,1), f(:,2), 1, "g");
    hold on;
    plot(args, f_normal, 'b', 'LineWidth', 2);
    grid;


    F = [];
    
    F(1, 1) = 8;
    F(1, 2) = 0;
    
    
    for i = 2 : (n + 1)
      cnt = 0;
      for j = 1 : n
        if X(j) <= X(i - 1)
          cnt = cnt + 1;
        end
      end
      
      F(i, 1) = X(i - 1);
      F(i, 2) = cnt / n;
    end
    
    F(n + 2, 1) = 17;
    F(n + 2, 2) = 1;

    F_normal = normcdf(args, mu, sigma);

    figure;
    stairs(F(:,1), F(:,2), "r");
    hold on;
    plot(args, F_normal, "b");
    grid;